const app = require('./app');
const config = require('./config');

const port = config.port || 3000;

app.listen(port, () => {
  console.log('\n');
  console.log('██████╗   ██████╗    ███████╗  ███████╗  ██╗   ██╗ ███████╗  ██╗     ████████╗ version 1.0');
  console.log('██╔══██╗ ██╔═══██╗   ██╔════╝  ██╔════╝  ██║   ██║ ██╔════╝  ██║     ╚══██╔══╝');
  console.log('██████╔╝ ██║   ██║   ███████╗  █████╗    ██║   ██║ █████╗    ██║        ██║   ');
  console.log('██╔══██╗ ██║   ██║   ╚════██║  ██╔══╝    ╚██╗ ██╔╝ ██╔══╝    ██║        ██║   ');
  console.log('██║  ██║ ╚██████╔╝   ███████║  ███████╗   ╚████╔╝  ███████╗  ███████╗   ██║   ');
  console.log('╚═╝  ╚═╝   ╚═════╝   ╚══════╝  ╚══════╝    ╚═══╝   ╚══════╝  ╚══════╝   ╚═╝   ');
  console.log('\n');
  console.log(`🚀 SERVER RUNNING ON PORT ${port}`);
  console.log(`📡 http://localhost:${port}`);
  console.log('\n');
});